{
    "initiator": {
        "role": "guest",
        "party_id": 10000
    },
    "job_parameters": {
        "work_mode": 1
    },
    "role": {
        "guest": [
            9999
        ],
        "host": [
            10000
        ],
        "arbiter": [
            99999
        ]
    },
    "role_parameters": {
        "guest": {
            "args": {
                "data": {
                    "train_data": [
                        {
                            "name": "homo_guest",
                            "namespace": "vehicle_scale"
                        }
                    ]
                }
            },
            "dataio_0": {
                "with_label": [
                    true
                ],
                "label_name": [
                    "y"
                ],
                "label_type": [
                    "int"
                ],
                "output_format": [
                    "dense"
                ]
            }
        },
        "host": {
            "args": {
                "data": {
                    "train_data": [
                        {
                            "name": "homo_host",
                            "namespace": "vehicle_scale"
                        },
                        {
                            "name": "homo_host",
                            "namespace": "vehicle_scale"
                        }
                    ]
                }
            },
            "dataio_0": {
                "with_label": [
                    true,
                    true
                ],
                "label_name": [
                    "y",
                    "y"
                ],
                "label_type": [
                    "int",
                    "int"
                ],
                "output_format": [
                    "dense",
                    "dense"
                ]
            }
        }
    },
    "algorithm_parameters": {
        "homo_nn_0": {
            "config_type": "keras",
            "nn_define": {
                "class_name": "Sequential",
                "config": {
                    "name": "sequential",
                    "layers": [
                        {
                            "class_name": "Reshape",
                            "config": {
                                "name": "reshape",
                                "trainable": true,
                                "dtype": "float32",
                                "target_shape": [
                                    32,
                                    32,
                                    3
                                ]
                            }
                        },
                        {
                            "class_name": "Model",
                            "config": {
                                "name": "resnet20",
                                "layers": [
                                    {
                                        "class_name": "InputLayer",
                                        "config": {
                                            "batch_input_shape": [
                                                null,
                                                32,
                                                32,
                                                3
                                            ],
                                            "dtype": "float32",
                                            "sparse": false,
                                            "ragged": false,
                                            "name": "input_1"
                                        },
                                        "name": "input_1",
                                        "inbound_nodes": []
                                    },
                                    {
                                        "class_name": "Conv2D",
                                        "config": {
                                            "name": "conv2d",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "filters": 16,
                                            "kernel_size": [
                                                3,
                                                3
                                            ],
                                            "strides": [
                                                1,
                                                1
                                            ],
                                            "padding": "same",
                                            "data_format": "channels_last",
                                            "dilation_rate": [
                                                1,
                                                1
                                            ],
                                            "activation": "linear",
                                            "use_bias": false,
                                            "kernel_initializer": {
                                                "class_name": "GlorotUniform",
                                                "config": {
                                                    "seed": null
                                                }
                                            },
                                            "bias_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "kernel_regularizer": {
                                                "class_name": "L1L2",
                                                "config": {
                                                    "l1": 0.0,
                                                    "l2": 9.999999747378752e-05
                                                }
                                            },
                                            "bias_regularizer": null,
                                            "activity_regularizer": null,
                                            "kernel_constraint": null,
                                            "bias_constraint": null
                                        },
                                        "name": "conv2d",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "input_1",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "BatchNormalization",
                                        "config": {
                                            "name": "batch_normalization",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "axis": [
                                                3
                                            ],
                                            "momentum": 0.99,
                                            "epsilon": 0.001,
                                            "center": true,
                                            "scale": true,
                                            "beta_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "gamma_initializer": {
                                                "class_name": "Ones",
                                                "config": {}
                                            },
                                            "moving_mean_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "moving_variance_initializer": {
                                                "class_name": "Ones",
                                                "config": {}
                                            },
                                            "beta_regularizer": null,
                                            "gamma_regularizer": null,
                                            "beta_constraint": null,
                                            "gamma_constraint": null
                                        },
                                        "name": "batch_normalization",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "conv2d",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Activation",
                                        "config": {
                                            "name": "activation",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "activation": "relu"
                                        },
                                        "name": "activation",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "batch_normalization",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Conv2D",
                                        "config": {
                                            "name": "conv2d_1",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "filters": 16,
                                            "kernel_size": [
                                                3,
                                                3
                                            ],
                                            "strides": [
                                                1,
                                                1
                                            ],
                                            "padding": "same",
                                            "data_format": "channels_last",
                                            "dilation_rate": [
                                                1,
                                                1
                                            ],
                                            "activation": "linear",
                                            "use_bias": false,
                                            "kernel_initializer": {
                                                "class_name": "GlorotUniform",
                                                "config": {
                                                    "seed": null
                                                }
                                            },
                                            "bias_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "kernel_regularizer": {
                                                "class_name": "L1L2",
                                                "config": {
                                                    "l1": 0.0,
                                                    "l2": 9.999999747378752e-05
                                                }
                                            },
                                            "bias_regularizer": null,
                                            "activity_regularizer": null,
                                            "kernel_constraint": null,
                                            "bias_constraint": null
                                        },
                                        "name": "conv2d_1",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "activation",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "BatchNormalization",
                                        "config": {
                                            "name": "batch_normalization_1",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "axis": [
                                                3
                                            ],
                                            "momentum": 0.99,
                                            "epsilon": 0.001,
                                            "center": true,
                                            "scale": true,
                                            "beta_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "gamma_initializer": {
                                                "class_name": "Ones",
                                                "config": {}
                                            },
                                            "moving_mean_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "moving_variance_initializer": {
                                                "class_name": "Ones",
                                                "config": {}
                                            },
                                            "beta_regularizer": null,
                                            "gamma_regularizer": null,
                                            "beta_constraint": null,
                                            "gamma_constraint": null
                                        },
                                        "name": "batch_normalization_1",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "conv2d_1",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Activation",
                                        "config": {
                                            "name": "activation_1",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "activation": "relu"
                                        },
                                        "name": "activation_1",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "batch_normalization_1",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Conv2D",
                                        "config": {
                                            "name": "conv2d_2",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "filters": 16,
                                            "kernel_size": [
                                                3,
                                                3
                                            ],
                                            "strides": [
                                                1,
                                                1
                                            ],
                                            "padding": "same",
                                            "data_format": "channels_last",
                                            "dilation_rate": [
                                                1,
                                                1
                                            ],
                                            "activation": "linear",
                                            "use_bias": false,
                                            "kernel_initializer": {
                                                "class_name": "GlorotUniform",
                                                "config": {
                                                    "seed": null
                                                }
                                            },
                                            "bias_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "kernel_regularizer": {
                                                "class_name": "L1L2",
                                                "config": {
                                                    "l1": 0.0,
                                                    "l2": 9.999999747378752e-05
                                                }
                                            },
                                            "bias_regularizer": null,
                                            "activity_regularizer": null,
                                            "kernel_constraint": null,
                                            "bias_constraint": null
                                        },
                                        "name": "conv2d_2",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "activation_1",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "BatchNormalization",
                                        "config": {
                                            "name": "batch_normalization_2",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "axis": [
                                                3
                                            ],
                                            "momentum": 0.99,
                                            "epsilon": 0.001,
                                            "center": true,
                                            "scale": true,
                                            "beta_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "gamma_initializer": {
                                                "class_name": "Ones",
                                                "config": {}
                                            },
                                            "moving_mean_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "moving_variance_initializer": {
                                                "class_name": "Ones",
                                                "config": {}
                                            },
                                            "beta_regularizer": null,
                                            "gamma_regularizer": null,
                                            "beta_constraint": null,
                                            "gamma_constraint": null
                                        },
                                        "name": "batch_normalization_2",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "conv2d_2",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Add",
                                        "config": {
                                            "name": "add",
                                            "trainable": true,
                                            "dtype": "float32"
                                        },
                                        "name": "add",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "activation",
                                                    0,
                                                    0,
                                                    {}
                                                ],
                                                [
                                                    "batch_normalization_2",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Activation",
                                        "config": {
                                            "name": "activation_2",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "activation": "relu"
                                        },
                                        "name": "activation_2",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "add",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Conv2D",
                                        "config": {
                                            "name": "conv2d_3",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "filters": 16,
                                            "kernel_size": [
                                                3,
                                                3
                                            ],
                                            "strides": [
                                                1,
                                                1
                                            ],
                                            "padding": "same",
                                            "data_format": "channels_last",
                                            "dilation_rate": [
                                                1,
                                                1
                                            ],
                                            "activation": "linear",
                                            "use_bias": false,
                                            "kernel_initializer": {
                                                "class_name": "GlorotUniform",
                                                "config": {
                                                    "seed": null
                                                }
                                            },
                                            "bias_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "kernel_regularizer": {
                                                "class_name": "L1L2",
                                                "config": {
                                                    "l1": 0.0,
                                                    "l2": 9.999999747378752e-05
                                                }
                                            },
                                            "bias_regularizer": null,
                                            "activity_regularizer": null,
                                            "kernel_constraint": null,
                                            "bias_constraint": null
                                        },
                                        "name": "conv2d_3",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "activation_2",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "BatchNormalization",
                                        "config": {
                                            "name": "batch_normalization_3",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "axis": [
                                                3
                                            ],
                                            "momentum": 0.99,
                                            "epsilon": 0.001,
                                            "center": true,
                                            "scale": true,
                                            "beta_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "gamma_initializer": {
                                                "class_name": "Ones",
                                                "config": {}
                                            },
                                            "moving_mean_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "moving_variance_initializer": {
                                                "class_name": "Ones",
                                                "config": {}
                                            },
                                            "beta_regularizer": null,
                                            "gamma_regularizer": null,
                                            "beta_constraint": null,
                                            "gamma_constraint": null
                                        },
                                        "name": "batch_normalization_3",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "conv2d_3",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Activation",
                                        "config": {
                                            "name": "activation_3",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "activation": "relu"
                                        },
                                        "name": "activation_3",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "batch_normalization_3",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Conv2D",
                                        "config": {
                                            "name": "conv2d_4",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "filters": 16,
                                            "kernel_size": [
                                                3,
                                                3
                                            ],
                                            "strides": [
                                                1,
                                                1
                                            ],
                                            "padding": "same",
                                            "data_format": "channels_last",
                                            "dilation_rate": [
                                                1,
                                                1
                                            ],
                                            "activation": "linear",
                                            "use_bias": false,
                                            "kernel_initializer": {
                                                "class_name": "GlorotUniform",
                                                "config": {
                                                    "seed": null
                                                }
                                            },
                                            "bias_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "kernel_regularizer": {
                                                "class_name": "L1L2",
                                                "config": {
                                                    "l1": 0.0,
                                                    "l2": 9.999999747378752e-05
                                                }
                                            },
                                            "bias_regularizer": null,
                                            "activity_regularizer": null,
                                            "kernel_constraint": null,
                                            "bias_constraint": null
                                        },
                                        "name": "conv2d_4",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "activation_3",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "BatchNormalization",
                                        "config": {
                                            "name": "batch_normalization_4",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "axis": [
                                                3
                                            ],
                                            "momentum": 0.99,
                                            "epsilon": 0.001,
                                            "center": true,
                                            "scale": true,
                                            "beta_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "gamma_initializer": {
                                                "class_name": "Ones",
                                                "config": {}
                                            },
                                            "moving_mean_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "moving_variance_initializer": {
                                                "class_name": "Ones",
                                                "config": {}
                                            },
                                            "beta_regularizer": null,
                                            "gamma_regularizer": null,
                                            "beta_constraint": null,
                                            "gamma_constraint": null
                                        },
                                        "name": "batch_normalization_4",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "conv2d_4",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Add",
                                        "config": {
                                            "name": "add_1",
                                            "trainable": true,
                                            "dtype": "float32"
                                        },
                                        "name": "add_1",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "activation_2",
                                                    0,
                                                    0,
                                                    {}
                                                ],
                                                [
                                                    "batch_normalization_4",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Activation",
                                        "config": {
                                            "name": "activation_4",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "activation": "relu"
                                        },
                                        "name": "activation_4",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "add_1",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Conv2D",
                                        "config": {
                                            "name": "conv2d_5",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "filters": 16,
                                            "kernel_size": [
                                                3,
                                                3
                                            ],
                                            "strides": [
                                                1,
                                                1
                                            ],
                                            "padding": "same",
                                            "data_format": "channels_last",
                                            "dilation_rate": [
                                                1,
                                                1
                                            ],
                                            "activation": "linear",
                                            "use_bias": false,
                                            "kernel_initializer": {
                                                "class_name": "GlorotUniform",
                                                "config": {
                                                    "seed": null
                                                }
                                            },
                                            "bias_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "kernel_regularizer": {
                                                "class_name": "L1L2",
                                                "config": {
                                                    "l1": 0.0,
                                                    "l2": 9.999999747378752e-05
                                                }
                                            },
                                            "bias_regularizer": null,
                                            "activity_regularizer": null,
                                            "kernel_constraint": null,
                                            "bias_constraint": null
                                        },
                                        "name": "conv2d_5",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "activation_4",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "BatchNormalization",
                                        "config": {
                                            "name": "batch_normalization_5",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "axis": [
                                                3
                                            ],
                                            "momentum": 0.99,
                                            "epsilon": 0.001,
                                            "center": true,
                                            "scale": true,
                                            "beta_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "gamma_initializer": {
                                                "class_name": "Ones",
                                                "config": {}
                                            },
                                            "moving_mean_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "moving_variance_initializer": {
                                                "class_name": "Ones",
                                                "config": {}
                                            },
                                            "beta_regularizer": null,
                                            "gamma_regularizer": null,
                                            "beta_constraint": null,
                                            "gamma_constraint": null
                                        },
                                        "name": "batch_normalization_5",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "conv2d_5",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Activation",
                                        "config": {
                                            "name": "activation_5",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "activation": "relu"
                                        },
                                        "name": "activation_5",
                                        "inbound_nodes": [
                                            [
                                                [
                                                    "batch_normalization_5",
                                                    0,
                                                    0,
                                                    {}
                                                ]
                                            ]
                                        ]
                                    },
                                    {
                                        "class_name": "Conv2D",
                                        "config": {
                                            "name": "conv2d_6",
                                            "trainable": true,
                                            "dtype": "float32",
                                            "filters": 16,
                                            "kernel_size": [
                                                3,
                                                3
                                            ],
                                            "strides": [
                                                1,
                                                1
