{
    "initiator": {
        "role": "guest",
        "party_id": 10000
    },
    "job_parameters": {
        "work_mode": 1
    },
    "role": {
        "guest": [
            9999
        ],
        "host": [
            10000
        ],
        "arbiter": [
            99999
        ]
    },
    "role_parameters": {
        "guest": {
            "args": {
                "data": {
                    "train_data": [
                        {
                            "name": "homo_guest",
                            "namespace": "vehicle_scale"
                        }
                    ]
                }
            },
            "dataio_0": {
                "with_label": [
                    true
                ],
                "label_name": [
                    "y"
                ],
                "label_type": [
                    "int"
                ],
                "output_format": [
                    "dense"
                ]
            }
        },
        "host": {
            "args": {
                "data": {
                    "train_data": [
                        {
                            "name": "homo_host",
                            "namespace": "vehicle_scale"
                        },
                        {
                            "name": "homo_host",
                            "namespace": "vehicle_scale"
                        }
                    ]
                }
            },
            "dataio_0": {
                "with_label": [
                    true,
                    true
                ],
                "label_name": [
                    "y",
                    "y"
                ],
                "label_type": [
                    "int",
                    "int"
                ],
                "output_format": [
                    "dense",
                    "dense"
                ]
            }
        }
    },
    "algorithm_parameters": {
        "homo_nn_0": {
            "config_type": "keras",
            "nn_define": {
                "class_name": "Sequential",
                "config": {
                    "name": "sequential",
                    "layers": [
                        {
                            "class_name": "Reshape",
                            "config": {
                                "name": "reshape",
                                "trainable": true,
                                "dtype": "float32",
                                "target_shape": [
                                    28,
                                    28,
                                    1
                                ]
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d",
                                "trainable": true,
                                "batch_input_shape": [
                                    null,
                                    28,
                                    28,
                                    1
                                ],
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "valid",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": {
                                    "class_name": "L1L2",
                                    "config": {
                                        "l1": 0.0,
                                        "l2": 9.999999747378752e-05
                                    }
                                },
                                "bias_regularizer": {
                                    "class_name": "L1L2",
                                    "config": {
                                        "l1": 0.0,
                                        "l2": 9.999999747378752e-05
                                    }
                                },
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_1",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "valid",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": {
                                    "class_name": "L1L2",
                                    "config": {
                                        "l1": 0.0,
                                        "l2": 9.999999747378752e-05
                                    }
                                },
                                "bias_regularizer": {
                                    "class_name": "L1L2",
                                    "config": {
                                        "l1": 0.0,
                                        "l2": 9.999999747378752e-05
                                    }
                                },
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "max_pooling2d",
                                "trainable": true,
                                "dtype": "float32",
                                "pool_size": [
                                    2,
                                    2
                                ],
                                "padding": "valid",
                                "strides": [
                                    2,
                                    2
                                ],
                                "data_format": "channels_last"
                            }
                        },
                        {
                            "class_name": "Dropout",
                            "config": {
                                "name": "dropout",
                                "trainable": true,
                                "dtype": "float32",
                                "rate": 0.25,
                                "noise_shape": null,
                                "seed": null
                            }
                        },
                        {
                            "class_name": "Flatten",
                            "config": {
                                "name": "flatten",
                                "trainable": true,
                                "dtype": "float32",
                                "data_format": "channels_last"
                            }
                        },
                        {
                            "class_name": "Dense",
                            "config": {
                                "name": "dense",
                                "trainable": true,
                                "dtype": "float32",
                                "units": 128,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": {
                                    "class_name": "L1L2",
                                    "config": {
                                        "l1": 0.0,
                                        "l2": 9.999999747378752e-05
                                    }
                                },
                                "bias_regularizer": {
                                    "class_name": "L1L2",
                                    "config": {
                                        "l1": 0.0,
                                        "l2": 9.999999747378752e-05
                                    }
                                },
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "Dropout",
                            "config": {
                                "name": "dropout_1",
                                "trainable": true,
                                "dtype": "float32",
                                "rate": 0.5,
                                "noise_shape": null,
                                "seed": null
                            }
                        },
                        {
                            "class_name": "Dense",
                            "config": {
                                "name": "dense_1",
                                "trainable": true,
                                "dtype": "float32",
                                "units": 62,
                                "activation": "softmax",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": {
                                    "class_name": "L1L2",
                                    "config": {
                                        "l1": 0.0,
                                        "l2": 9.999999747378752e-05
                                    }
                                },
                                "bias_regularizer": {
                                    "class_name": "L1L2",
                                    "config": {
                                        "l1": 0.0,
                                        "l2": 9.999999747378752e-05
                                    }
                                },
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        }
                    ],
                    "build_input_shape": [
                        null,
                        28,
                        28,
                        1
                    ]
                },
                "keras_version": "2.3.0-tf",
                "backend": "tensorflow"
            },
            "batch_size": 128,
            "optimizer": {
                "optimizer": "Adam",
                "learning_rate": 5e-4
            },
            "early_stop": {
                "early_stop": "diff",
                "eps": 0.0001
            },
            "loss": "categorical_crossentropy",
            "metrics": [
                "accuracy"
            ],
            "max_iter": 2,
            "secure_aggregate": "flashe",
            "secure_aggregate_args": {
                "quantize": {
                    "int_bits": 120,
                    "batch": true,
                    "element_bits": 16,
                    "padding": true,
                    "secure": true
                },
                "precompute": {
                    "enable": false
                },
                "mode": "parallel",
                "num_partitions": 1
            }
        }
    }
}